cf_billing/InformationRegisters/бестОповещенияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестОповещенияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСообщенияПользователям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/CommonForms/бестФормаНастройкиОповещенияПользователей/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Инициатор = Пользователи.ТекущийПользователь();
	
	ЗаполнитьСписокПользователей(Инициатор);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНаСервере()
	Если ЗначениеЗаполнено(Сообщение) Тогда
		Для каждого стр из СписокПользователей Цикл
			НаборЗаписей = РегистрыСведений.бестОповещенияПользователей.СоздатьНаборЗаписей();		
			НаборЗаписей.Отбор.Пользователь.Установить(стр.Пользователь);
			НаборЗаписей.Отбор.Сообщение.Установить(Сообщение);
			
			НоваяЗапись = НаборЗаписей.Добавить(); 
			
			НоваяЗапись.Пользователь 	= стр.Пользователь; 
			НоваяЗапись.Сообщение 		= Сообщение; 
			НоваяЗапись.Инициатор 		= Инициатор;
			
			НаборЗаписей.Записать();	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСообщение(Команда)
	ВыполнитьНаСервере();
	
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПользователей(ТекПользователь)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекПользователь", ТекПользователь);
	Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.Недействителен
	|	И НЕ Пользователи.Ссылка = &ТекПользователь
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователь";
	Результат = Запрос.Выполнить();
	Выгрузка = Результат.Выгрузить();
	
	СписокПользователей.Загрузить(Выгрузка);
КонецПроцедуры
